#ifndef UI_H
#define UI_H

#include "Grid.h"   // Підключення класу, який відповідає за представлення сітки головоломки
#include "Solver.h" // Підключення класу, який містить алгоритм розв’язання головоломки

// Клас UI відповідає за взаємодію з користувачем
class UI {
public:
    // Основна функція запуску інтерфейсу користувача
    void run();

private:
    // Метод для ініціалізації головоломки: ручне введення або вибір з тестів
    Grid initGrid(int mode);

    // Метод для відображення меню дій після вибору головоломки
    void actionMenu(Grid& grid);
};

#endif // UI_H

